In [1]:
import pandas as pd

# Series

In [3]:
date = [1, 2, 3, 4, 5]

In [4]:
s = pd.Series(date)

In [5]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
index = ['Line' + str(i) for i in range(5)]

In [16]:
index

['Line0', 'Line1', 'Line2', 'Line3', 'Line4']

In [17]:
s = pd.Series(date, index)

In [18]:
s

Line0    1
Line1    2
Line2    3
Line3    4
Line4    5
dtype: int64

In [20]:
date = {'Linha' + str(i) : i + 1 for i in range(5)}

In [21]:
date

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [22]:
s = pd.Series(date)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [23]:
s1 = s + 2

In [24]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

# DataFrame

In [25]:
date = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [26]:
date

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [27]:
df1 = pd.DataFrame(date)

In [28]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [29]:
index = ['Line' + str(i) for i in range(3)]

In [30]:
index

['Line0', 'Line1', 'Line2']

In [31]:
df1 = pd.DataFrame(date, index)

In [32]:
df1

       0  1  2
Line0  1  2  3
Line1  4  5  6
Line2  7  8  9

In [39]:
columns = ['Column' + str(i) for i in range(3)]

In [40]:
df1 = pd.DataFrame(date, index, columns=columns)

In [41]:
df1

       Column0  Column1  Column2
Line0        1        2        3
Line1        4        5        6
Line2        7        8        9

In [44]:
df = {'Column0' : {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
     'Column1' : {'Linha0': 4, 'Linha1:': 5, 'Linha2': 8},
     'Column2' : {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [45]:
df

{'Column0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Column1': {'Linha0': 4, 'Linha1:': 5, 'Linha2': 8},
 'Column2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [47]:
df2 = pd.DataFrame(df)

In [48]:
df2

         Column0  Column1  Column2
Linha0       1.0      4.0      3.0
Linha1       4.0      NaN      6.0
Linha1:      NaN      5.0      NaN
Linha2       7.0      8.0      9.0

In [49]:
df1[df1 > 0] = 'A'

In [50]:
df1

      Column0 Column1 Column2
Line0       A       A       A
Line1       A       A       A
Line2       A       A       A

In [51]:
df2[df2 > 0] = 'B'

In [52]:
df2

        Column0 Column1 Column2
Linha0        B       B       B
Linha1        B     NaN       B
Linha1:     NaN       B     NaN
Linha2        B       B       B

In [53]:
df3 = pd.concat([df1, df2])

In [54]:
df3

        Column0 Column1 Column2
Line0         A       A       A
Line1         A       A       A
Line2         A       A       A
Linha0        B       B       B
Linha1        B     NaN       B
Linha1:     NaN       B     NaN
Linha2        B       B       B

In [55]:
df3 = pd.concat([df1, df2], axis = 1)

In [56]:
df3

        Column0 Column1 Column2 Column0 Column1 Column2
Line0         A       A       A     NaN     NaN     NaN
Line1         A       A       A     NaN     NaN     NaN
Line2         A       A       A     NaN     NaN     NaN
Linha0      NaN     NaN     NaN       B       B       B
Linha1      NaN     NaN     NaN       B     NaN       B
Linha1:     NaN     NaN     NaN     NaN       B     NaN
Linha2      NaN     NaN     NaN       B       B       B